In [1]:
import ast
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from datasets import load_dataset

dataset = load_dataset('lukebarousse/data_jobs')
df=dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])
df['job_skills'] = df['job_skills'].apply(lambda x: ast.literal_eval(x) if pd.notna(x) else x)

/opt/anaconda3/envs/python_course/lib/python3.11/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
df_DA_US = df[(df['job_country']=='United States') & (df['job_title_short']=='Data Analyst')].copy()

In [3]:
df_DA_US=df_DA_US.dropna(subset=['salary_year_avg'])
df_DA_US_exploded = df_DA_US.explode('job_skills')
df_DA_US_exploded[['salary_year_avg', 'job_skills']].head(10)

     salary_year_avg  job_skills
109          89000.0      python
109          89000.0           r
109          89000.0     alteryx
109          89000.0     tableau
180          90250.0       excel
180          90250.0  powerpoint
410         133285.0         sql
410         133285.0        word
410         133285.0       excel
410         133285.0       visio

In [6]:
df_DA_skills = df_DA_US_exploded.groupby('job_skills')['salary_year_avg'].agg(['count', 'median']).sort_values(by='count', ascending=False)
df_DA_skills = df_DA_skills.rename(columns={'count': 'skill_count', 'median':'median_salary'})
df_DA_skills

            skill_count  median_salary
job_skills
sql                2508        91000.0
excel              1808        84392.0
python             1431        97500.0
tableau            1364        92875.0
sas                 926        90000.0
...                 ...            ...
couchbase             1       160515.0
chainer               1       100000.0
chef                  1        85000.0
cordova               1       113269.5
node.js               1        83500.0

[170 rows x 2 columns]

In [9]:
DA_job_count = len(df_DA_US)
df_DA_skills['skill_percent'] = df_DA_skills['skill_count']/DA_job_count * 100
skill_percent = 5
df_DA_skills_high_demand = df_DA_skills[df_DA_skills['skill_percent']>skill_percent]
df_DA_skills_high_demand

            skill_count  median_salary  skill_persent  skill_percent
job_skills
sql                2508       91000.00      57.655172      57.655172
excel              1808       84392.00      41.563218      41.563218
python             1431       97500.00      32.896552      32.896552
tableau            1364       92875.00      31.356322      31.356322
sas                 926       90000.00      21.287356      21.287356
r                   893       92500.00      20.528736      20.528736
power bi            838       90000.00      19.264368      19.264368
powerpoint          462       85000.00      10.620690      10.620690
word                461       81194.75      10.597701      10.597701
sql server          286       92500.00       6.574713       6.574713
oracle              274       96923.75       6.298851       6.298851
go                  224       90000.00       5.149425       5.149425